Seba-P/dash-7-project/stack/framework/hal/chips/efm32pg1b/efm32pg1b_spi.c
/* * OSS-7 - An opensource implementation of the DASH7 Alliance Protocol for ultra
 * lowpower wireless sensor communication
 *
 * Copyright 2015 University of Antwerp
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*! \file efm32pg1b_spi.c
 *
 * \author jeremie@wizzilab.com
 * \author daniel.vandenakker@uantwerpen.be
 * \author contact@christophe.vg
 */

#include <stdbool.h>
#include <stdint.h>

#include "debug.h"

#include "em_device.h"
#include "em_chip.h"
#include "em_usart.h"
#include "em_gpio.h"
#include "em_dma.h"
#include "em_cmu.h"
#include "em_emu.h"
#include "em_int.h"

#include "hwgpio.h"
#include "hwspi.h"

#include "platform.h"

#define USARTS    2
#define LOCATIONS 32

typedef struct {
  uint32_t location;
  pin_id_t mosi;
  pin_id_t miso;
  pin_id_t clk;
} spi_pins_t;

static spi_pins_t location[USARTS][LOCATIONS] = {
  {
    // USART 0
    {
      .location = 0,
      .mosi     = { .port = gpioPortA, .pin = 0 },
      .miso     = { .port = gpioPortA, .pin = 1 },
      .clk      = { .port = gpioPortA, .pin = 2 }
    },
    {
      .location = 1,
      .mosi     = { .port = gpioPortA, .pin = 1 },
      .miso     = { .port = gpioPortA, .pin = 2 },
      .clk      = { .port = gpioPortA, .pin = 3 }
    },
    {
      .location = 2,
      .mosi     = { .port = gpioPortA, .pin = 2 },
      .miso     = { .port = gpioPortA, .pin = 3 },
      .clk      = { .port = gpioPortA, .pin = 4 }
    },
    {
      .location = 3,
      .mosi     = { .port = gpioPortA, .pin = 3 },
      .miso     = { .port = gpioPortA, .pin = 4 },
      .clk      = { .port = gpioPortA, .pin = 5 }
    },
    {
      .location = 4,
      .mosi     = { .port = gpioPortA, .pin = 4 },
      .miso     = { .port = gpioPortA, .pin = 5 },
      .clk      = { .port = gpioPortB, .pin = 11 }
    },
    {
      .location = 5,
      .mosi     = { .port = gpioPortA, .pin = 5 },
      .miso     = { .port = gpioPortB, .pin = 11 },
      .clk      = { .port = gpioPortB, .pin = 12 }
    },
    {
      .location = 6,
      .mosi     = { .port = gpioPortB, .pin = 11 },
      .miso     = { .port = gpioPortB, .pin = 12 },
      .clk      = { .port = gpioPortB, .pin = 13 }
    },
    {
      .location = 7,
      .mosi     = { .port = gpioPortB, .pin = 12 },
      .miso     = { .port = gpioPortB, .pin = 13 },
      .clk      = { .port = gpioPortB, .pin = 14 }
    },
    {
      .location = 8,
      .mosi     = { .port = gpioPortB, .pin = 13 },
      .miso     = { .port = gpioPortB, .pin = 14 },
      .clk      = { .port = gpioPortB, .pin = 15 }
    },
    {
      .location = 9,
      .mosi     = { .port = gpioPortB, .pin = 14 },
      .miso     = { .port = gpioPortB, .pin = 15 },
      .clk      = { .port = gpioPortC, .pin = 6 }
    },
    {
      .location = 10,
      .mosi     = { .port = gpioPortB, .pin = 15 },
      .miso     = { .port = gpioPortC, .pin = 6 },
      .clk      = { .port = gpioPortC, .pin = 7 }
    },
    {
      .location = 11,
      .mosi     = { .port = gpioPortC, .pin = 6 },
      .miso     = { .port = gpioPortC, .pin = 7 },
      .clk      = { .port = gpioPortC, .pin = 8 }
    },
    {
      .location = 12,
      .mosi     = { .port = gpioPortC, .pin = 7 },
      .miso     = { .port = gpioPortC, .pin = 8 },
      .clk      = { .port = gpioPortC, .pin = 9 }
    },
    {
      .location = 13,
      .mosi     = { .port = gpioPortC, .pin = 8 },
      .miso     = { .port = gpioPortC, .pin = 9 },
      .clk      = { .port = gpioPortC, .pin = 10 }
    },
    {
      .location = 14,
      .mosi     = { .port = gpioPortC, .pin = 9 },
      .miso     = { .port = gpioPortC, .pin = 10 },
      .clk      = { .port = gpioPortC, .pin = 11 }
    },
    {
      .location = 15,
      .mosi     = { .port = gpioPortC, .pin = 10 },
      .miso     = { .port = gpioPortC, .pin = 11 },
      .clk      = { .port = gpioPortD, .pin = 9 }
    },
    {
      .location = 16,
      .mosi     = { .port = gpioPortC, .pin = 11 },
      .miso     = { .port = gpioPortD, .pin = 9 },
      .clk      = { .port = gpioPortD, .pin = 10 }
    },
    {
      .location = 17,
      .mosi     = { .port = gpioPortD, .pin = 9 },
      .miso     = { .port = gpioPortD, .pin = 10 },
      .clk      = { .port = gpioPortD, .pin = 11 }
    },
    {
      .location = 18,
      .mosi     = { .port = gpioPortD, .pin = 10 },
      .miso     = { .port = gpioPortD, .pin = 11 },
      .clk      = { .port = gpioPortD, .pin = 12 }
    },
    {
      .location = 19,
      .mosi     = { .port = gpioPortD, .pin = 11 },
      .miso     = { .port = gpioPortD, .pin = 12 },
      .clk      = { .port = gpioPortD, .pin = 13 }
    },
    {
      .location = 20,
      .mosi     = { .port = gpioPortD, .pin = 12 },
      .miso     = { .port = gpioPortD, .pin = 13 },
      .clk      = { .port = gpioPortD, .pin = 14 }
    },
    {
      .location = 21,
      .mosi     = { .port = gpioPortD, .pin = 13 },
      .miso     = { .port = gpioPortD, .pin = 14 },
      .clk      = { .port = gpioPortD, .pin = 15 }
    },
    {
      .location = 22,
      .mosi     = { .port = gpioPortD, .pin = 14 },
      .miso     = { .port = gpioPortD, .pin = 15 },
      .clk      = { .port = gpioPortF, .pin = 0 }
    },
    {
      .location = 23,
      .mosi     = { .port = gpioPortD, .pin = 15 },
      .miso     = { .port = gpioPortF, .pin = 0 },
      .clk      = { .port = gpioPortF, .pin = 1 }
    },
    {
      .location = 24,
      .mosi     = { .port = gpioPortF, .pin = 0 },
      .miso     = { .port = gpioPortF, .pin = 1 },
      .clk      = { .port = gpioPortF, .pin = 2 }
    },
    {
      .location = 25,
      .mosi     = { .port = gpioPortF, .pin = 1 },
      .miso     = { .port = gpioPortF, .pin = 2 },
      .clk      = { .port = gpioPortF, .pin = 3 }
    },
    {
      .location = 26,
      .mosi     = { .port = gpioPortF, .pin = 2 },
      .miso     = { .port = gpioPortF, .pin = 3 },
      .clk      = { .port = gpioPortF, .pin = 4 }
    },
    {
      .location = 27,
      .mosi     = { .port = gpioPortF, .pin = 3 },
      .miso     = { .port = gpioPortF, .pin = 4 },
      .clk      = { .port = gpioPortF, .pin = 5 }
    },
    {
      .location = 28,
      .mosi     = { .port = gpioPortF, .pin = 4 },
      .miso     = { .port = gpioPortF, .pin = 5 },
      .clk      = { .port = gpioPortF, .pin = 6 }
    },
    {
      .location = 29,
      .mosi     = { .port = gpioPortF, .pin = 5 },
      .miso     = { .port = gpioPortF, .pin = 6 },
      .clk      = { .port = gpioPortF, .pin = 7 }
    },
    {
      .location = 30,
      .mosi     = { .port = gpioPortF, .pin = 6 },
      .miso     = { .port = gpioPortF, .pin = 7 },
      .clk      = { .port = gpioPortA, .pin = 0 }
    },
    {
      .location = 31,
      .mosi     = { .port = gpioPortF, .pin = 7 },
      .miso     = { .port = gpioPortA, .pin = 0 },
      .clk      = { .port = gpioPortA, .pin = 1 }
    }
  },
  {
    // USART 1
    {
      .location = 0,
      .mosi     = { .port = gpioPortA, .pin = 0 },
      .miso     = { .port = gpioPortA, .pin = 1 },
      .clk      = { .port = gpioPortA, .pin = 2 }
    },
    {
      .location = 1,
      .mosi     = { .port = gpioPortA, .pin = 1 },
      .miso     = { .port = gpioPortA, .pin = 2 },
      .clk      = { .port = gpioPortA, .pin = 3 }
    },
    {
      .location = 2,
      .mosi     = { .port = gpioPortA, .pin = 2 },
      .miso     = { .port = gpioPortA, .pin = 3 },
      .clk      = { .port = gpioPortA, .pin = 4 }
    },
    {
      .location = 3,
      .mosi     = { .port = gpioPortA, .pin = 3 },
      .miso     = { .port = gpioPortA, .pin = 4 },
      .clk      = { .port = gpioPortA, .pin = 5 }
    },
    {
      .location = 4,
      .mosi     = { .port = gpioPortA, .pin = 4 },
      .miso     = { .port = gpioPortA, .pin = 5 },
      .clk      = { .port = gpioPortB, .pin = 11 }
    },
    {
      .location = 5,
      .mosi     = { .port = gpioPortA, .pin = 5 },
      .miso     = { .port = gpioPortB, .pin = 11 },
      .clk      = { .port = gpioPortB, .pin = 12 }
    },
    {
      .location = 6,
      .mosi     = { .port = gpioPortB, .pin = 11 },
      .miso     = { .port = gpioPortB, .pin = 12 },
      .clk      = { .port = gpioPortB, .pin = 13 }
    },
    {
      .location = 7,
      .mosi     = { .port = gpioPortB, .pin = 12 },
      .miso     = { .port = gpioPortB, .pin = 13 },
      .clk      = { .port = gpioPortB, .pin = 14 }
    },
    {
      .location = 8,
      .mosi     = { .port = gpioPortB, .pin = 13 },
      .miso     = { .port = gpioPortB, .pin = 14 },
      .clk      = { .port = gpioPortB, .pin = 15 }
    },
    {
      .location = 9,
      .mosi     = { .port = gpioPortB, .pin = 14 },
      .miso     = { .port = gpioPortB, .pin = 15 },
      .clk      = { .port = gpioPortC, .pin = 6 }
    },
    {
      .location = 10,
      .mosi     = { .port = gpioPortB, .pin = 15 },
      .miso     = { .port = gpioPortC, .pin = 6 },
      .clk      = { .port = gpioPortC, .pin = 7 }
    },
    {
      .location = 11,
      .mosi     = { .port = gpioPortC, .pin = 6 },
      .miso     = { .port = gpioPortC, .pin = 7 },
      .clk      = { .port = gpioPortC, .pin = 8 }
    },
    {
      .location = 12,
      .mosi     = { .port = gpioPortC, .pin = 7 },
      .miso     = { .port = gpioPortC, .pin = 8 },
      .clk      = { .port = gpioPortC, .pin = 9 }
    },
    {
      .location = 13,
      .mosi     = { .port = gpioPortC, .pin = 8 },
      .miso     = { .port = gpioPortC, .pin = 9 },
      .clk      = { .port = gpioPortC, .pin = 10 }
    },
    {
      .location = 14,
      .mosi     = { .port = gpioPortC, .pin = 9 },
      .miso     = { .port = gpioPortC, .pin = 10 },
      .clk      = { .port = gpioPortC, .pin = 11 }
    },
    {
      .location = 15,
      .mosi     = { .port = gpioPortC, .pin = 10 },
      .miso     = { .port = gpioPortC, .pin = 11 },
      .clk      = { .port = gpioPortD, .pin = 9 }
    },
    {
      .location = 16,
      .mosi     = { .port = gpioPortC, .pin = 11 },
      .miso     = { .port = gpioPortD, .pin = 9 },
      .clk      = { .port = gpioPortD, .pin = 10 }
    },
    {
      .location = 17,
      .mosi     = { .port = gpioPortD, .pin = 9 },
      .miso     = { .port = gpioPortD, .pin = 10 },
      .clk      = { .port = gpioPortD, .pin = 11 }
    },
    {
      .location = 18,
      .mosi     = { .port = gpioPortD, .pin = 10 },
      .miso     = { .port = gpioPortD, .pin = 11 },
      .clk      = { .port = gpioPortD, .pin = 12 }
    },
    {
      .location = 19,
      .mosi     = { .port = gpioPortD, .pin = 11 },
      .miso     = { .port = gpioPortD, .pin = 12 },
      .clk      = { .port = gpioPortD, .pin = 13 }
    },
    {
      .location = 20,
      .mosi     = { .port = gpioPortD, .pin = 12 },
      .miso     = { .port = gpioPortD, .pin = 13 },
      .clk      = { .port = gpioPortD, .pin = 14 }
    },
    {
      .location = 21,
      .mosi     = { .port = gpioPortD, .pin = 13 },
      .miso     = { .port = gpioPortD, .pin = 14 },
      .clk      = { .port = gpioPortD, .pin = 15 }
    },
    {
      .location = 22,
      .mosi     = { .port = gpioPortD, .pin = 14 },
      .miso     = { .port = gpioPortD, .pin = 15 },
      .clk      = { .port = gpioPortF, .pin = 0 }
    },
    {
      .location = 23,
      .mosi     = { .port = gpioPortD, .pin = 15 },
      .miso     = { .port = gpioPortF, .pin = 0 },
      .clk      = { .port = gpioPortF, .pin = 1 }
    },
    {
      .location = 24,
      .mosi     = { .port = gpioPortF, .pin = 0 },
      .miso     = { .port = gpioPortF, .pin = 1 },
      .clk      = { .port = gpioPortF, .pin = 2 }
    },
    {
      .location = 25,
      .mosi     = { .port = gpioPortF, .pin = 1 },
      .miso     = { .port = gpioPortF, .pin = 2 },
      .clk      = { .port = gpioPortF, .pin = 3 }
    },
    {
      .location = 26,
      .mosi     = { .port = gpioPortF, .pin = 2 },
      .miso     = { .port = gpioPortF, .pin = 3 },
      .clk      = { .port = gpioPortF, .pin = 4 }
    },
    {
      .location = 27,
      .mosi     = { .port = gpioPortF, .pin = 3 },
      .miso     = { .port = gpioPortF, .pin = 4 },
      .clk      = { .port = gpioPortF, .pin = 5 }
    },
    {
      .location = 28,
      .mosi     = { .port = gpioPortF, .pin = 4 },
      .miso     = { .port = gpioPortF, .pin = 5 },
      .clk      = { .port = gpioPortF, .pin = 6 }
    },
    {
      .location = 29,
      .mosi     = { .port = gpioPortF, .pin = 5 },
      .miso     = { .port = gpioPortF, .pin = 6 },
      .clk      = { .port = gpioPortF, .pin = 7 }
    },
    {
      .location = 30,
      .mosi     = { .port = gpioPortF, .pin = 6 },
      .miso     = { .port = gpioPortF, .pin = 7 },
      .clk      = { .port = gpioPortA, .pin = 0 }
    },
    {
      .location = 31,
      .mosi     = { .port = gpioPortF, .pin = 7 },
      .miso     = { .port = gpioPortA, .pin = 0 },
      .clk      = { .port = gpioPortA, .pin = 1 }
    }
  }
};

typedef struct spi_usart {
  USART_TypeDef*    channel;
  CMU_Clock_TypeDef clock;
} spi_usart_t;

// private storage for usarts, pointers to these records are passed around
static spi_usart_t usart[USARTS] = {
  {
    .channel = USART0,
    .clock   = cmuClock_USART0
  },
  {
    .channel = USART1,
    .clock   = cmuClock_USART1
  },
};

#define MAX_SPI_HANDLES 4              // TODO expose this in chip configuration
#define MAX_SPI_SLAVE_HANDLES 4        // TODO expose this in chip configuration

// private implementation of handle structs
struct spi_handle {
  spi_usart_t*        usart;
  spi_pins_t*         pins;
  uint32_t            baudrate;
  uint8_t             databits;
  bool                msbf;
  spi_slave_handle_t* slave[MAX_SPI_SLAVE_HANDLES];
  uint8_t             slaves;  // number of slaves for array mgmt
  uint8_t             users;   // for reference counting of active slaves
  bool                auto_power;
  bool                active;
};

// private storage to spi handles, pointers to these are passed around
uint8_t      next_spi_handle = 0;
spi_handle_t handle[MAX_SPI_HANDLES];

struct spi_slave_handle {
  spi_handle_t* spi;
  pin_id_t      cs;
  bool          cs_is_active_low;
  bool          selected;
};

// private storage to spi slave handles, pointers to these are passed around
uint8_t            next_spi_slave_handle = 0;
spi_slave_handle_t slave_handle[MAX_SPI_SLAVE_HANDLES];

// internal implementation to manage power automagically

static void ensure_slaves_deselected(spi_handle_t* spi) {
  // make sure CS lines for all slaves of this bus are high for active low
  // slaves and vice versa
  for(uint8_t s=0; s<spi->slaves; s++) {
    if(spi->slave[s]->cs_is_active_low) {
      hw_gpio_set(spi->slave[s]->cs);
    } else {
      hw_gpio_clr(spi->slave[s]->cs);
    }
  }
}

void spi_enable(spi_handle_t* spi) {
  // already active?
  if(spi->active) { return; }

  // bringing SPI bus up
  ensure_slaves_deselected(spi);

  // CMU_ClockEnable(cmuClock_GPIO,    true); // TODO future use: hw_gpio_enable
  CMU_ClockEnable(spi->usart->clock, true);

	USART_InitSync_TypeDef usartInit = USART_INITSYNC_DEFAULT;

  usartInit.databits  = spi->databits == 9 ? usartDatabits9 : usartDatabits8;
  usartInit.baudrate  = spi->baudrate;
  usartInit.master    = true;
  usartInit.msbf      = spi->msbf;
  usartInit.clockMode = usartClockMode0;
  
  USART_InitSync(spi->usart->channel, &usartInit);
  USART_Enable(spi->usart->channel, usartEnable);

  spi->usart->channel->ROUTEPEN = USART_ROUTEPEN_RXPEN | USART_ROUTEPEN_TXPEN | USART_ROUTEPEN_CLKPEN;
  spi->usart->channel->ROUTELOC0 = (spi->pins->location << _USART_ROUTELOC0_RXLOC_SHIFT) 
                                  | (spi->pins->location << _USART_ROUTELOC0_TXLOC_SHIFT)
                                  | (spi->pins->location << _USART_ROUTELOC0_CLKLOC_SHIFT);

  spi->active = true;
}

void spi_disable(spi_handle_t* spi) {
  // already inactive?
  if( ! spi->active ) { return; }
  
  // reset route to make sure that TX pin will become low after disable
  spi->usart->channel->ROUTEPEN = _USART_ROUTEPEN_RESETVALUE;

  USART_Enable(spi->usart->channel, usartDisable);
  CMU_ClockEnable(spi->usart->clock, false);
  // CMU_ClockEnable(cmuClock_GPIO, false); // TODO future use: hw_gpio_disable

  // turn off all CS lines, because bus is down
  // clients should be powered down also
  for(uint8_t s=0; s<spi->slaves; s++) {
    hw_gpio_clr(spi->slave[s]->cs);
  }
  
  spi->active = false;
}

// public interface

spi_handle_t* spi_init(uint8_t idx,  uint32_t baudrate, uint8_t databits,
                       bool    msbf, uint8_t  pins)
{
  // limit pre-allocated handles
  assert(next_spi_handle < MAX_SPI_HANDLES);

  // assert what is supported by HW and emlib
  assert(databits == 8 || databits == 9);
  assert(idx < USARTS);
  assert(pins < LOCATIONS); // TODO: not more implemented yet

  // configure new handle
  handle[next_spi_handle] = (spi_handle_t){
    .usart      = &usart[idx],
    .pins       = &location[idx][pins],
    .baudrate   = baudrate,
    .databits   = databits,
    .msbf       = msbf,
    .slaves     = 0,
    .users      = 0,
    .active     = false
  };
 
  // pins can be reused, e.g. same configuration, different baudrate
  error_t err;
  err = hw_gpio_configure_pin(handle[next_spi_handle].pins->mosi, false, gpioModePushPull, 0);
  assert( err == SUCCESS || err == EALREADY );
  err = hw_gpio_configure_pin(handle[next_spi_handle].pins->miso, false, gpioModeInput,    0);
  assert( err == SUCCESS || err == EALREADY );
  err = hw_gpio_configure_pin(handle[next_spi_handle].pins->clk,  false, gpioModePushPull, 0);
  assert( err == SUCCESS || err == EALREADY );

  // enable SPI bus if we're not doing auto power mgmgt
  if( ! handle[next_spi_handle].auto_power ) {
    spi_enable(&handle[next_spi_handle]);
  }

  next_spi_handle++;
  return &handle[next_spi_handle-1];
}

spi_slave_handle_t* spi_init_slave(spi_handle_t* spi, pin_id_t cs_pin, bool cs_is_active_low) {
  // limit pre-allocated handles
  assert(next_spi_slave_handle < MAX_SPI_SLAVE_HANDLES);

  // Configure CS pin as output.
  // If the bus is already active and we have an active low slave we pull CS
  // high to prevent the slave from starting.
  // If the bus is not already active (powered down) we keep CS low (selected)
  // to prevent current flowing to the slave.
  bool initial_level = spi->active > 0 && cs_is_active_low;
  assert(hw_gpio_configure_pin(cs_pin, false, gpioModePushPull, initial_level) == SUCCESS);

  slave_handle[next_spi_slave_handle] = (spi_slave_handle_t){
    .spi              = spi,
    .cs               = cs_pin,
    .cs_is_active_low = cs_is_active_low,
    .selected         = false
  };
  
  // add slave to spi for back-reference
  spi->slave[spi->slaves] = &slave_handle[next_spi_slave_handle];
  spi->slaves++;
  
  next_spi_slave_handle++;
  return &slave_handle[next_spi_slave_handle-1];
}

void spi_select(spi_slave_handle_t* slave) {
  if( slave->selected ) { return; } // already selected

  if(slave->cs_is_active_low) {     // select slave
    hw_gpio_clr(slave->cs);
  } else {
    hw_gpio_set(slave->cs);
  }

  slave->selected = true;           // mark it
}

void spi_deselect(spi_slave_handle_t* slave) {
  if( ! slave->selected ) { return; } // already deselected

  if(slave->cs_is_active_low) {       // deselect slave
    hw_gpio_set(slave->cs);
  } else {
    hw_gpio_clr(slave->cs);
  }

  slave->selected = false;            // unmark it
}

unsigned char spi_exchange_byte(spi_slave_handle_t* slave, unsigned char data) {
  return USART_SpiTransfer(slave->spi->usart->channel, data);
}

void spi_send_byte_with_control(spi_slave_handle_t* slave, uint16_t data) {
  USART_TxExt(slave->spi->usart->channel, data);
}

void spi_exchange_bytes(spi_slave_handle_t* slave,
                        uint8_t* TxData, uint8_t* RxData, unsigned int length)
{
  uint16_t i = 0;
  if( RxData != NULL && TxData != NULL ) {           // two way transmition
    while( i < length ) {
      RxData[i] = spi_exchange_byte(slave, TxData[i]);
      i++;
    }
  } else if( RxData == NULL && TxData != NULL ) {    // send only
    while( i < length ) {
      spi_exchange_byte(slave, TxData[i]);
      i++;
    }
  } else if( RxData != NULL && TxData == NULL ) {   // recieve only
    while( i < length ) {
      RxData[i] = spi_exchange_byte(slave, 0);
      i++;
    }
  }
}
